// Detect psexec activity
// Possible lateral movement attacker activity
DeviceEvents 
| where Timestamp > ago(7d)
| where ActionType == "ServiceInstalled"
| where FileName contains "PSEXESVC.exe" and AdditionalFields contains "PSEXESVC"
