DeviceFileEvents 
| where Timestamp > ago(7d)
| where ActionType =="FileCreated"
| where FileName endswith @"._AiraCropEncrypted"
     or FileName endswith @".0x0"
     or FileName endswith @".1cbu1"
     or FileName endswith @".1txt"
     or FileName endswith @".73i87A"
     or FileName endswith @".a5zfn"
     or FileName endswith @".aaa"
     or FileName endswith @".abc"
     or FileName endswith @".adk"
     or FileName endswith @".aesir"
     or FileName endswith @".alcatraz"
     or FileName endswith @".angelamerkel"
     or FileName endswith @".AngleWare"
     or FileName endswith @".antihacker2017"
     or FileName endswith @".atlas"
     or FileName endswith @".axx"
     or FileName endswith @".BarRax"
     //or FileName endswith @".bin"
     or FileName endswith @".bitstak"
     or FileName endswith @".bleep"
     or FileName endswith @".braincrypt"
     or FileName endswith @".breaking_bad"
     or FileName endswith @".bript"
     or FileName endswith @".btc"
     or FileName endswith @".ccc"
     or FileName endswith @".CCCRRRPPP"
     or FileName endswith @".cerber"
     or FileName endswith @".cerber2"
     or FileName endswith @".cerber3"
     or FileName endswith @".coded"
     or FileName endswith @".comrade"
     or FileName endswith @".conficker"
     or FileName endswith @".coverton"
     or FileName endswith @".crinf"
     or FileName endswith @".crjoker"
     or FileName endswith @".crptrgr"
     or FileName endswith @".cry"
     or FileName endswith @".cryeye"
     or FileName endswith @".cryp1"
     //or FileName endswith @".crypt"
     or FileName endswith @".crypte"
     or FileName endswith @".crypted"
     or FileName endswith @".crypto"
     or FileName endswith @".cryptolocker"
     or FileName endswith @".cryptowall"
     or FileName endswith @".crypz"
     or FileName endswith @".CTB2"
     or FileName endswith @".CTBL"
     or FileName endswith @".czvxce"
     or FileName endswith @".d4nk"
     or FileName endswith @".dale"
     or FileName endswith @".damage"
     or FileName endswith @".darkness"
     or FileName endswith @".dCrypt"
     or FileName endswith @".decrypt2017"
     or FileName endswith @".Dexter"
     or FileName endswith @".dharma"
     //or FileName endswith @".dll"
     or FileName endswith @".dxxd"
     or FileName endswith @".ecc"
     or FileName endswith @".edgel"
     or FileName endswith @".enc"
     or FileName endswith @".enciphered"
     or FileName endswith @".encr"
     or FileName endswith @".encrypt"
     or FileName endswith @".encrypted"
     or FileName endswith @".encryptedRSA"
     or FileName endswith @".enigma"
     or FileName endswith @".evillock"
     or FileName endswith @".exotic"
     or FileName endswith @".exx"
     or FileName endswith @".ezz"
     or FileName endswith @".fantom"
     or FileName endswith @".file0locked"
     or FileName endswith @".fucked"
     or FileName endswith @".fun"
     or FileName endswith @".gefickt"
     or FileName endswith @".globe"
     or FileName endswith @".good"
     or FileName endswith @".grt"
     or FileName endswith @".ha3"
     or FileName endswith @".helpmeencedfiles"
     or FileName endswith @".herbst"
     or FileName endswith @".hnumkhotep"
     or FileName endswith @".hush"
     or FileName endswith @".ifuckedyou"
     or FileName endswith @".info"
     or FileName endswith @".kernel_complete"
     or FileName endswith @".kernel_pid"
     or FileName endswith @".kernel_time"
     or FileName endswith @".keybtc@inbox_com"
     or FileName endswith @".kimcilware"
     or FileName endswith @".kkk"
     or FileName endswith @".kostya"
     or FileName endswith @".kraken"
     or FileName endswith @".kratos"
     or FileName endswith @".kyra"
     or FileName endswith @".lcked"
     or FileName endswith @".LeChiffre"
     or FileName endswith @".legion"
     or FileName endswith @".lesli"
     or FileName endswith @".lock93"
     or FileName endswith @".locked"
     or FileName endswith @".locklock"
     or FileName endswith @".locky"
     or FileName endswith @".lol!"
     or FileName endswith @".loli"
     or FileName endswith @".lovewindows"
     or FileName endswith @".madebyadam"
     or FileName endswith @".magic"
     or FileName endswith @".maya"
     or FileName endswith @".MERRY"
     or FileName endswith @".micro"
     or FileName endswith @".mole"
     or FileName endswith @".MRCR1"
     or FileName endswith @".noproblemwedecfiles."
     or FileName endswith @".nuclear55"
     or FileName endswith @".odcodc"
     or FileName endswith @".odin"
     or FileName endswith @".OMG!"
     or FileName endswith @".onion"
     or FileName endswith @".oops"
     or FileName endswith @".osiris"
     or FileName endswith @".p5tkjw"
     or FileName endswith @".padcrypt"
     or FileName endswith @".paym"
     or FileName endswith @".paymrss"
     or FileName endswith @".payms"
     or FileName endswith @".paymst"
     or FileName endswith @".paymts"
     or FileName endswith @".payrms"
     or FileName endswith @".pays"
     or FileName endswith @".pdcr"
     or FileName endswith @".pec"
     or FileName endswith @".PEGS1"
     or FileName endswith @".perl"
     or FileName endswith @".PoAr2w"
     or FileName endswith @".potato"
     or FileName endswith @".powerfulldecrypt"
     or FileName endswith @".pubg"
     or FileName endswith @".purge"
     or FileName endswith @".pzdc"
     or FileName endswith @".R16m01d05"
     or FileName endswith @".r5a"
     or FileName endswith @".raid10"
     or FileName endswith @".RARE1"
     or FileName endswith @".razy"
     or FileName endswith @".rdm"
     or FileName endswith @".realfs0ciety@sigaint.org.fs0ciety"
     or FileName endswith @".rekt"
     or FileName endswith @".rip"
     or FileName endswith @".RMCM1"
     or FileName endswith @".rmd"
     or FileName endswith @".rnsmwr"
     or FileName endswith @".rokku"
     or FileName endswith @".rrk"
     or FileName endswith @".ruby"
     or FileName endswith @".sage"
     or FileName endswith @".SecureCrypted"
     or FileName endswith @".serp"
     or FileName endswith @".serpent"
     or FileName endswith @".sexy"
     or FileName endswith @".shit"
     or FileName endswith @".spora"
     or FileName endswith @".stn"
     or FileName endswith @".SUPERCRYPT"
     or FileName endswith @".surprise"
     or FileName endswith @".szf"
     or FileName endswith @".theworldisyours"
     or FileName endswith @".thor"
     or FileName endswith @".toxcrypt"
     or FileName endswith @".ttt"
     or FileName endswith @".unavailable"
     or FileName endswith @".vault"
     or FileName endswith @".vbransom"
     or FileName endswith @".venusf"
     or FileName endswith @".VforVendetta"
     or FileName endswith @".vindows"
     or FileName endswith @".vvv"
     or FileName endswith @".vxlock"
     or FileName endswith @".wallet"
     or FileName endswith @".wcry"
     or FileName endswith @".wflx"
     or FileName endswith @".Whereisyourfiles"
     or FileName endswith @".windows10"
     or FileName endswith @".XRNT"
     or FileName endswith @".XTBL"
     or FileName endswith @".xxx"
     or FileName endswith @".xyz"
     or FileName endswith @".ytbl"
     or FileName endswith @".zcrypt"
     or FileName endswith @".zepto"
     or FileName endswith @".zorro"
     or FileName endswith @".zyklon"
     or FileName endswith @".zzz"
     or FileName endswith @".zzzzz"
     or FileName endswith @"_crypt"