DeviceFileEvents
| where ActionType == "FileCreated"
| where Timestamp > ago(7d)
| where FileName contains "HELP_RESTORE_FILES"
     or FileName contains "HELP_DECRYPT"
     or FileName contains "HELP_YOUR_FILES"
     or FileName contains "HELP_TO_DECRYPT_YOUR_FILES"
     or FileName contains "RECOVERY_KEY"
     or FileName contains "HELP_RECOVER_FILES"
     or FileName contains "HELP_TO_SAVE_FILES"
     or FileName contains "DecryptAllFiles"
     or FileName contains "DECRYPT_INSTRUCTIONS"
     or FileName contains "INSTRUCCIONES_DESCIFRADO"
     or FileName contains "How_To_Recover_Files"
     or FileName contains "YOUR_FILES"
     or FileName contains "encryptor_raas_readme_liesmich"
     or FileName contains "Help_Decrypt"
     or FileName contains "DECRYPT_INSTRUCTION"
     or FileName contains "HOW_TO_DECRYPT_FILES"
     or FileName contains "ReadDecryptFilesHere"
     or FileName contains "Coin.Locker"
     or FileName contains "secret_code"
     or FileName contains "About_Files"
     //or FileName contains "Read.txt"
     //or FileName contains "ReadMe.txt"
     or FileName contains "DECRYPT_ReadMe"
     or FileName contains "DecryptAllFiles"
     or FileName contains "FILESAREGONE"
     or FileName contains "IAMREADYTOPAY"
     or FileName contains "HELLOTHERE"
     or FileName contains "READTHISNOW!!!"
     or FileName contains "SECRETIDHERE.KEY"
     or FileName contains "IHAVEYOURSECRET.KEY"
     //or FileName contains "SECRET.KEY"
     or FileName contains "HELP_DECYPRT_YOUR_FILES.HTML"
     or FileName contains "help_decrypt_your_files.html"
     or FileName contains "HELP_TO_SAVE_FILES.txt"
     or FileName contains "RECOVERY_FILES.txt"
     or FileName contains "RECOVERY_FILE.TXT"
     or FileName contains "RECOVERY_FILE_"
     or FileName contains "Howto_RESTORE_FILES_"
     or FileName contains "howto_recover_file_"
     or FileName contains "restore_files_"
     or FileName contains "how_recover+"
     or FileName contains "how_recover.txt"
     or FileName contains "recovery_file_"
     or FileName contains "recover_file_"
     or FileName contains "recovery_file_.txt"
     or FileName contains "Howto_Restore_FILES."
     or FileName contains "help_recover_instructions"
     or FileName contains "_Locky_recover_instructions"